examples/tait_2017_microring_weight_bank_surrogate.yaml
benchmark:
  name: Tait 2017 microring weight-bank WDM surrogate
  description: Source-backed card for the Scientific Reports 2017 broadcast-and-weight microring neural network. The local workload maps a 24-node recurrent weight-bank step to a 24x24 by 24x1 matvec surrogate with optical-interconnect movement assumptions.
workload:
  type: matmul
  m: 24
  n: 1
  k: 24
device:
  optical_mac_energy_fj: 0.5
  laser_wall_plug_efficiency: 0.25
  photodetector_energy_fj_per_sample: 10
  adc:
    bits: 8
    energy_pj_per_conversion: 0.5
  vector_dac:
    bits: 8
    energy_pj_per_conversion: 0.2
  weight_dac:
    bits: 8
    energy_pj_per_conversion: 0.2
execution:
  batch_size: 1
  vector_reuse_factor: 1
  weight_reuse_factor: 1
  weight_stationary: true
  pipeline:
    stages: 1
system:
  profile: optical_interconnect
timing:
  optical_latency_ns: 1
  adc_latency_ns: 0
  dac_latency_ns: 0
noise:
  phase_noise_rad_rms: 0.02
  drift_rad_per_second: 0.1
  integration_time_ns: 1
provenance:
  source_title: Neuromorphic photonic networks using silicon photonic weight banks
  source_url: https://www.nature.com/articles/s41598-017-07754-z
  doi: 10.1038/s41598-017-07754-z
  venue: Scientific Reports 7, Article 7430 (2017)
  claim_status: paper-reported broadcast-and-weight architecture and 24-node simulation; WDM matvec surrogate
published_calibration:
  architecture: Silicon photonic broadcast-and-weight microring weight-bank network
  additional_metrics:
    simulated_nodes: 24
    microring_weights: 576
    laser_modulator_count: 24
    weight_bank_count: 24
    expected_system_power_mw: 106
    predicted_acceleration_vs_conventional: 294
    protocol: wavelength-division multiplexed broadcast-and-weight
    surrogate_mapping: m=24, k=24, n=1 follows one 24-node recurrent weight-bank matvec step; it is not a full recurrent network simulation.
source_quality:
  reported_metrics:
    - architecture
    - node_count
    - weight_count
    - power_estimate
    - acceleration_estimate
  local_surrogate_type: wdm_microring_weight_bank_matvec_surrogate
  coverage:
    throughput: derived
    energy: estimated
    accuracy: derived
    area: reported
    precision: not_reported
  confidence_grade: B
  notes:
    - The source anchors WDM broadcast-and-weight memory behavior and scale, while local energy and contention outputs are PhotonicBench scenario estimates.
assumptions:
  - Source-reported 24-node, 576-weight, expected-power, and acceleration figures remain under published_calibration.
  - The optical_interconnect scenario is used to stress WDM/broadcast movement; it is not a measured link model from the paper.
  - Weight-stationary mode approximates microring weight banks for one local recurrent-network step.